# FbxLightDimmingLightColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightDimmingLightColor Property
ParameterTypeId Class See Also
---
"Dimming Lamp Color Temperature Shift"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightDimmingLightColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightDimmingLightColor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightDimmingLightColor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace